<?php
/**
 * Объединить две ранее написанные функции в одну, которая получает строку на русском языке, производит транслитерацию и замену пробелов на подчеркивания
 */

function translit2($str) {
	$arr = [];
	$arr = ['а'=>'a', 'б'=>'b', 'в'=>'v', 'г'=>'g', 'д'=>'d', 'е'=>'e', 'ё'=>'jo', 'ж'=>'zh', 'з'=>'z', 'и'=>'i', 'й'=>'j', 'к'=>'k', 'л'=>'l',
	        'м'=>'m', 'н'=>'n', 'о'=>'o', 'п'=>'p', 'р'=>'r', 'с'=>'s', 'т'=>'t', 'у'=>'u', 'ф'=>'f', 'х'=>'h', 'ц'=>'c', 'ч'=>'ch',
	        'ш'=>'sh', 'щ'=>'sch', 'ь'=>'\'', 'ы'=>'y', 'э'=>'je', 'ю'=>'ju', 'я'=>'ja', 'А'=>'A', 'Б'=>'B', 'В'=>'V', 'Г'=>'G', 'Д'=>'D',
	        'Е'=>'E', 'Ё'=>'Jo', 'Ж'=>'Zh', 'З'=>'Z', 'И'=>'I', 'Й'=>'J', 'К'=>'K', 'Л'=>'L', 'М'=>'M', 'Н'=>'N', 'О'=>'O', 'П'=>'P',
	        'Р'=>'R', 'С'=>'S', 'Т'=>'T', 'У'=>'U', 'Ф'=>'F', 'Х'=>'H', 'Ц'=>'C', 'Ч'=>'Ch', 'Ш'=>'Sh', 'Щ'=>'Sch', 'Э'=>'Je', 'Ю'=>'Ju', 'Я'=>'Ja'];
	foreach ($arr as $rus=>$lat) {
		$str = str_replace($rus, $lat, $str);
	}

	$str = str_replace(' ', '_', $str);

	return $str;
}

echo translit2 ('Урок 3 Циклы и массивы');

